contener/data/CI4/app/Models/ArtistSpotlightModel.php

    public function getTopSellers(int $limit = 8): array
    {
        return $this->db->table('beats b')
            ->select('u.id as user_id, u.username, u.avatar, u.artist_genre, COUNT(b.id) as sold_count')
            ->join('users u', 'u.id = b.user_id')
            ->where('b.buyer_id IS NOT NULL', null, false)
            ->groupBy('b.user_id')
            ->orderBy('sold_count', 'DESC')
            ->limit($limit)
            ->get()->getResultArray();
---
SELECT `u`.`id` as `user_id`, `u`.`username`, `u`.`avatar`, `u`.`artist_genre`, COUNT(b.id) as sold_count
FROM `beats` `b`
JOIN `users` `u` ON `u`.`id` = `b`.`user_id`
WHERE b.buyer_id IS NOT NULL
GROUP BY `b`.`user_id`
ORDER BY `sold_count` DESC
 LIMIT 8

    public function getTopPosters(int $limit = 8): array
    {
        return $this->db->table('beats b')
            ->select('u.id as user_id, u.username, u.avatar, u.artist_genre, COUNT(b.id) as available_count')
            ->join('users u', 'u.id = b.user_id')
            ->where('b.status', 'active')
            ->where('b.buyer_id', null)
            ->groupBy('b.user_id')
            ->orderBy('available_count', 'DESC')
            ->limit($limit)
            ->get()->getResultArray();
---
SELECT `u`.`id` as `user_id`, `u`.`username`, `u`.`avatar`, `u`.`artist_genre`, COUNT(b.id) as available_count
FROM `beats` `b`
JOIN `users` `u` ON `u`.`id` = `b`.`user_id`
WHERE `b`.`status` = 'active'
AND `b`.`buyer_id` IS NULL
GROUP BY `b`.`user_id`
ORDER BY `available_count` DESC
 LIMIT 8

    public function getSoldBeatsForUsers(array $userIds, int $perUser = 6): array
    {
        if (empty($userIds)) return [];

        $rows = $this->db->table('beats b')
            ->select('b.id, b.user_id, b.title, b.price, c.name as category_name')
            ->join('categories c', 'c.id = b.category_id')
            ->whereIn('b.user_id', $userIds)
            ->where('b.buyer_id IS NOT NULL', null, false)
            ->orderBy('b.sold_at', 'DESC')
            ->get()->getResultArray();
---
SELECT `b`.`id`, `b`.`user_id`, `b`.`title`, `b`.`price`, `c`.`name` as `category_name`
FROM `beats` `b`
JOIN `categories` `c` ON `c`.`id` = `b`.`category_id`
WHERE `b`.`user_id` IN (2)
AND b.buyer_id IS NOT NULL
ORDER BY `b`.`sold_at` DESC

    public function getAvailableBeatsForUsers(array $userIds, int $perUser = 6): array
    {
        if (empty($userIds)) return [];

        $rows = $this->db->table('beats b')
            ->select('b.id, b.user_id, b.title, b.price, c.name as category_name')
            ->join('categories c', 'c.id = b.category_id')
            ->whereIn('b.user_id', $userIds)
            ->where('b.status', 'active')
            ->where('b.buyer_id', null)
            ->orderBy('b.created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT `b`.`id`, `b`.`user_id`, `b`.`title`, `b`.`price`, `c`.`name` as `category_name`
FROM `beats` `b`
JOIN `categories` `c` ON `c`.`id` = `b`.`category_id`
WHERE `b`.`user_id` IN (2,3,1)
AND `b`.`status` = 'active'
AND `b`.`buyer_id` IS NULL
ORDER BY `b`.`created_at` DESC