contener/data/CI4/app/Models/BeatFileModel.php

    public function getPathByType(int $beatId, string $type): ?string
    {
        $row = $this->where('beat_id', $beatId)
            ->where('type', $type)
            ->first();
---
SELECT *
FROM `beat_files`
WHERE `beat_id` = 10
AND `type` = 'preview_mp3'
 LIMIT 1