contener/data/CI4/app/Models/BeatModel.php

SELECT `b`.*, `c`.`name` AS `category_name`, `u`.`username` AS `seller_username`
FROM `beats` `b`
LEFT JOIN `categories` `c` ON `c`.`id` = `b`.`category_id`
LEFT JOIN `users` `u` ON `u`.`id` = `b`.`user_id`
WHERE `b`.`status` = 'active'
AND `b`.`buyer_id` IS NULL
ORDER BY `b`.`is_featured` DESC, `b`.`created_at` DESC
 LIMIT 30
---
    public function getDefaultFeed(int $limit = 30): array
    {
        return $this->db->table('beats b')
            ->select('b.*, c.name AS category_name, u.username AS seller_username')
            ->join('categories c', 'c.id = b.category_id', 'left')
            ->join('users u', 'u.id = b.user_id', 'left')
            ->where('b.status', 'active')
            ->where('b.buyer_id', null)
            ->orderBy('b.is_featured', 'DESC')
            ->orderBy('b.created_at', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT `b`.*, `c`.`name` AS `category_name`, `u`.`username` AS `seller_username`
FROM `beats` `b`
LEFT JOIN `categories` `c` ON `c`.`id` = `b`.`category_id`
LEFT JOIN `users` `u` ON `u`.`id` = `b`.`user_id`
WHERE `b`.`id` = 10
---
    public function getOneWithJoins(int $id): ?array
    {
        $row = $this->db->table('beats b')
            ->select('b.*, c.name AS category_name, u.username AS seller_username')
            ->join('categories c', 'c.id = b.category_id', 'left')
            ->join('users u', 'u.id = b.user_id', 'left')
            ->where('b.id', $id)
            ->get()
            ->getRowArray();